tap "derailed/popeye"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "teamookla/speedtest"
tap "tnk-studio/tools"
# Simple, modern, secure file encryption
brew "age"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# GitOps Continuous Delivery for Kubernetes
brew "argocd"
# Microsoft Azure CLI 2.0
brew "azure-cli"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Command-line tool for DigitalOcean
brew "doctl"
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Command-line fuzzy finder written in Go
brew "fzf"
# WebDriver <-> Marionette proxy
brew "geckodriver"
# Distributed revision control system
brew "git"
# Audit git repos for secrets
brew "gitleaks"
# Core application library for C
brew "glib"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Kubernetes package manager
brew "helm"
# Deploy Kubernetes Helm Charts
brew "helmfile"
# Modern load testing tool, using Go and JavaScript
brew "k6"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "k9s"
# Package manager for kubectl plugins
brew "krew"
# Easily check your clusters for use of deprecated APIs
brew "kubent"
# Kubernetes controller and tool for one-way encrypted Secrets
brew "kubeseal"
# API Traffic Analyzer providing real-time visibility into Kubernetes network
brew "kubeshark"
# Lazier way to manage everything docker
brew "lazydocker"
# Simple terminal UI for git commands
brew "lazygit"
# Run a Kubernetes cluster locally
brew "minikube"
# Automated testing for Ansible roles
brew "molecule"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Port scanning utility for large networks
brew "nmap"
# Platform built on V8 to build network applications
brew "node"
# Realtime distributed messaging platform
brew "nsq"
# Information gathering framework for phone numbers
brew "phoneinfoga"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Theme for zsh
brew "powerlevel10k"
# Python version management
brew "pyenv"
# File browser
brew "ranger"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# User interface to the TELNET protocol
brew "telnet"
# Terminal multiplexer
brew "tmux"
# Manage complex tmux sessions easily
brew "tmuxinator"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# HTTP load testing tool and library
brew "vegeta"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# Network analyzer and capture tool - without graphical user interface
brew "wireshark"
# JavaScript package manager
brew "yarn"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# A Kubernetes Cluster sanitizer and linter!
brew "derailed/popeye/popeye"
# Terraform
brew "hashicorp/tap/terraform"
# Ookla Speedtest
brew "teamookla/speedtest/speedtest"
brew "tnk-studio/tools/lazykube"
# Voice and text chat software
cask "discord"
# Web browser focusing on privacy
cask "duckduckgo"
# Web browser
cask "firefox"
cask "font-3270-nerd-font"
cask "font-symbols-only-nerd-font"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "google-cloud-sdk"
# GPU-based terminal emulator
cask "kitty"
# Project management software
cask "lark"
# Interactive tool for analyzing MongoDB data
cask "mongodb-compass"
# Neovim Client
cask "neovide"
# Web browser
cask "opera"
# Collaboration platform for API development
cask "postman"
# Keyboard-driven, vim-like browser based on PyQt5
cask "qutebrowser"
# Music streaming service
cask "spotify"
# Native desktop client for WhatsApp
cask "whatsapp"
vscode "aaron-bond.better-comments"
vscode "andi1984.tinypng"
vscode "batisteo.vscode-django"
vscode "chakrounanas.turbo-console-log"
vscode "christian-kohler.npm-intellisense"
vscode "chrmarti.regex"
vscode "cstrap.flask-snippets"
vscode "dominicvonk.parameter-hints"
vscode "donjayamanne.githistory"
vscode "donjayamanne.python-environment-manager"
vscode "donjayamanne.python-extension-pack"
vscode "dotjoshjohnson.xml"
vscode "ecmel.vscode-html-css"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-rename-tag"
vscode "genieai.chatgpt-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.vscode-github-actions"
vscode "golang.go"
vscode "hashicorp.terraform"
vscode "hediet.vscode-drawio"
vscode "hookyqr.beautify"
vscode "humao.rest-client"
vscode "icrawl.discord-vscode"
vscode "janjoerke.jenkins-pipeline-linter-connector"
vscode "jebbs.plantuml"
vscode "juanblanco.solidity"
vscode "kamikillerto.vscode-colorize"
vscode "kevinrose.vsc-python-indent"
vscode "kisstkondoros.vscode-gutter-preview"
vscode "mads-hartmann.bash-ide-vscode"
vscode "magicstack.magicpython"
vscode "mattiasbaake.vscode-snippets-for-ansible"
vscode "mikestead.dotenv"
vscode "mohsen1.prettify-json"
vscode "mongodb.mongodb-vscode"
vscode "ms-azuretools.vscode-azurecontainerapps"
vscode "ms-azuretools.vscode-azureresourcegroups"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.azure-account"
vscode "ms-vscode.azurecli"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.vscode-typescript-next"
vscode "ms-vsliveshare.vsliveshare"
vscode "mtxr.sqltools"
vscode "mtxr.sqltools-driver-mysql"
vscode "mtxr.sqltools-driver-pg"
vscode "mtxr.sqltools-driver-sqlite"
vscode "njpwerner.autodocstring"
vscode "nomicfoundation.hardhat-solidity"
vscode "oderwat.indent-rainbow"
vscode "patbenatar.advanced-new-file"
vscode "phind.phind"
vscode "pkief.material-icon-theme"
vscode "pranaygp.vscode-css-peek"
vscode "redhat.vscode-yaml"
vscode "rogalmic.bash-debug"
vscode "rohit-chouhan.sqlite-snippet"
vscode "rpinski.shebang-snippets"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "sleistner.vscode-fileutils"
vscode "sumneko.lua"
vscode "svelte.svelte-vscode"
vscode "tabeyti.jenkins-jack"
vscode "thomascsd.vscode-readme-pattern"
vscode "tim-koehler.helm-intellisense"
vscode "tobermory.es6-string-html"
vscode "usernamehw.errorlens"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscodevim.vim"
vscode "wakatime.vscode-wakatime"
vscode "wholroyd.jinja"
vscode "wix.vscode-import-cost"
vscode "xabikos.javascriptsnippets"
vscode "zhuangtongfa.material-theme"
vscode "zignd.html-css-class-completion"
