tap "bufbuild/buf"
tap "derailed/popeye"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "jandedobbeleer/oh-my-posh"
tap "pulumi/tap"
tap "teamookla/speedtest"
tap "tnk-studio/tools"
# Simple, modern, secure file encryption
brew "age"
# GitOps Continuous Delivery for Kubernetes
brew "argocd"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Microsoft Azure CLI 2.0
brew "azure-cli"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Core application library for C
brew "glib"
# Command-line tool for DigitalOcean
brew "doctl"
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# Simple, fast and user-friendly alternative to find
brew "fd"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Command-line fuzzy finder written in Go
brew "fzf"
# WebDriver <-> Marionette proxy
brew "geckodriver"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Audit git repos for secrets
brew "gitleaks"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Fast linters runner for Go
brew "golangci-lint"
# Kubernetes package manager
brew "helm"
# Deploy Kubernetes Helm Charts
brew "helmfile"
# Modern load testing tool, using Go and JavaScript
brew "k6"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "k9s"
# Package manager for kubectl plugins
brew "krew"
# Easily check your clusters for use of deprecated APIs
brew "kubent"
# Kubernetes controller and tool for one-way encrypted Secrets
brew "kubeseal"
# API Traffic Analyzer providing real-time visibility into Kubernetes network
brew "kubeshark"
# Lazier way to manage everything docker
brew "lazydocker"
# Simple terminal UI for git commands
brew "lazygit"
# Command-line interface to LiveKit
brew "livekit-cli"
# Run a Kubernetes cluster locally
brew "minikube"
# Automated testing for Ansible roles
brew "molecule"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Port scanning utility for large networks
brew "nmap"
# Platform built on V8 to build network applications
brew "node"
# HTTP load generator, inspired by rakyll/hey with tui animation
brew "oha"
# Generate clients, server & docs from an OpenAPI spec (v2, v3)
brew "openapi-generator"
# CLI for Postgres with auto-completion and syntax highlighting
brew "pgcli"
# Information gathering framework for phone numbers
brew "phoneinfoga"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Object-relational database system
brew "postgresql@17"
# Theme for zsh
brew "powerlevel10k"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Python version management
brew "pyenv"
# File browser
brew "ranger"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Safe, concurrent, practical language
brew "rust"
# Cross-shell prompt for astronauts
brew "starship"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Modern and pretty fancy file manager for the terminal
brew "superfile"
# User interface to the TELNET protocol
brew "telnet"
# Terminal multiplexer
brew "tmux"
# Manage complex tmux sessions easily
brew "tmuxinator"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Distributed SQL query engine for big data
brew "trino"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# HTTP load testing tool and library
brew "vegeta"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# Network analyzer and capture tool - without graphical user interface
brew "wireshark"
# JavaScript package manager
brew "yarn"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Zsh port of Fish shell's history search
brew "zsh-history-substring-search"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# The best way of working with Protocol Buffers.
brew "bufbuild/buf/buf"
# A Kubernetes Cluster sanitizer and linter!
brew "derailed/popeye/popeye"
# Terraform
brew "hashicorp/tap/terraform"
# Prompt theme engine for any shell
brew "jandedobbeleer/oh-my-posh/oh-my-posh"
# Pulumi - Modern Infrastructure as Code. Any cloud, any language 
brew "pulumi/tap/pulumi"
# Ookla Speedtest
brew "teamookla/speedtest/speedtest"
brew "tnk-studio/tools/lazykube"
# Voice and text chat software
cask "discord"
# Web browser focusing on privacy
cask "duckduckgo"
# Web browser
cask "firefox"
cask "font-3270-nerd-font"
cask "font-symbols-only-nerd-font"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "google-cloud-sdk"
# Project management software
cask "lark"
# Interactive tool for analyzing MongoDB data
cask "mongodb-compass"
# Web browser
cask "opera"
# Collaboration platform for API development
cask "postman"
# Music streaming service
cask "spotify"
# Native desktop client for WhatsApp
cask "whatsapp"
vscode "donjayamanne.githistory"
vscode "hediet.vscode-drawio"
vscode "mhutchie.git-graph"
