tap "bufbuild/buf"
tap "derailed/popeye"
tap "fleet/local"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "jandedobbeleer/oh-my-posh"
tap "productdevbook/tap"
tap "pulumi/tap"
tap "skyhook-io/tap"
tap "teamookla/speedtest"
tap "tnk-studio/tools"
tap "tonisives/tap"
tap "valkyrie00/bbrew"
tap "wickenico/wailbrew"
# Run your GitHub Actions locally
brew "act"
# Simple, modern, secure file encryption
brew "age"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Reactive CLI that generates commit messages for Git and Jujutsu with AI
brew "aicommit2"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# GitOps Continuous Delivery for Kubernetes
brew "argocd"
# Automatic configure script builder
brew "autoconf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Microsoft Azure CLI 2.0
brew "azure-cli"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext"
# Core application library for C
brew "glib"
# Tool for exploring each layer in a docker image
brew "dive"
# Command-line tool for DigitalOcean
brew "doctl"
# Text to speech, software speech synthesizer
brew "espeak"
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Plugin manager for the Fish shell
brew "fisher"
# Generic library support script
brew "libtool"
# Command-line fuzzy finder written in Go
brew "fzf"
# WebDriver <-> Marionette proxy
brew "geckodriver"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Audit git repos for secrets
brew "gitleaks"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Fast linters runner for Go
brew "golangci-lint"
# Develop LLM Apps in Natural Language
brew "gptscript"
# Interactive web UI for gRPC, along the lines of postman
brew "grpcui"
# Kubernetes package manager
brew "helm"
# Deploy Kubernetes Helm Charts
brew "helmfile"
# Tools and libraries to manipulate images in select formats
brew "imagemagick"
# Istio configuration command-line utility
brew "istioctl"
# Git-compatible distributed version control system
brew "jj"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Interactive environments for writing and running code
brew "jupyterlab"
# Modern load testing tool, using Go and JavaScript
brew "k6"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "k9s"
# Package manager for kubectl plugins
brew "krew"
# Easily check your clusters for use of deprecated APIs
brew "kubent"
# Kubernetes controller and tool for one-way encrypted Secrets
brew "kubeseal"
# API Traffic Analyzer providing real-time visibility into Kubernetes network
brew "kubeshark"
# Lazier way to manage everything docker
brew "lazydocker"
# Simple terminal UI for git commands
brew "lazygit"
# Command-line interface to LiveKit
brew "livekit-cli"
# Fast, flexible, config-based cli for linting Markdown/CommonMark files
brew "markdownlint-cli2"
# Run a Kubernetes cluster locally
brew "minikube"
# Automated testing for Ansible roles
brew "molecule"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Port scanning utility for large networks
brew "nmap"
# Manage multiple Node.js versions
brew "nvm"
# HTTP load generator, inspired by rakyll/hey with tui animation
brew "oha"
# Generate clients, server & docs from an OpenAPI spec (v2, v3)
brew "openapi-generator"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# AI coding agent, built for the terminal
brew "opencode"
# CLI for Postgres with auto-completion and syntax highlighting
brew "pgcli"
# Data loading tool for PostgreSQL
brew "pgloader"
# Information gathering framework for phone numbers
brew "phoneinfoga"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Fast, disk space efficient package manager
brew "pnpm"
# Tool for managing OCI containers and pods
brew "podman"
# Python package management tool
brew "poetry"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Object-relational database system
brew "postgresql@17"
# Theme for zsh
brew "powerlevel10k"
# Framework for managing multi-language pre-commit hooks
brew "pre-commit", link: false
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Python version management
brew "pyenv"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# File browser
brew "ranger"
# SVG rendering tool and library
brew "resvg"
# Safe, concurrent, practical language
brew "rust"
# 7-Zip is a file archiver with a high compression ratio
brew "sevenzip"
# Editor of encrypted files
brew "sops"
# Cross-shell prompt for astronauts
brew "starship"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Modern and pretty fancy file manager for the terminal
brew "superfile"
# User interface to the TELNET protocol
brew "telnet"
# Terminal multiplexer
brew "tmux"
# Shell completion for Tmuxinator
brew "tmuxinator-completion"
# Manage complex tmux sessions easily
brew "tmuxinator"
# Distributed SQL query engine for big data
brew "trino"
# Cozy typing speed tester in terminal
brew "typioca"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# HTTP load testing tool and library
brew "vegeta"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# Network analyzer and capture tool - without graphical user interface
brew "wireshark"
# Why is this running?
brew "witr"
# JavaScript package manager
brew "yarn"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Zsh port of Fish shell's history search
brew "zsh-history-substring-search"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# The best way of working with Protocol Buffers.
brew "bufbuild/buf/buf"
# A Kubernetes Cluster sanitizer and linter!
brew "derailed/popeye/popeye"
# Terraform
brew "hashicorp/tap/terraform"
# Pulumi - Modern Infrastructure as Code. Any cloud, any language
brew "pulumi/tap/pulumi"
# Modern Kubernetes visibility — topology, traffic, and Helm management
brew "skyhook-io/tap/radar", link: false
# Ookla Speedtest
brew "teamookla/speedtest/speedtest"
# Modern TUI for managing Homebrew packages and casks on macOS and Linux
brew "valkyrie00/bbrew/bbrew"
# Command-line interface for 1Password
cask "1password-cli"
# Distribution of the Python and R programming languages for scientific computing
cask "anaconda"
# Open source IDE for exploring and testing APIs
cask "bruno"
# UI to create reproducible developer environments based on a devcontainer.json
cask "devpod"
# Voice and text chat software
cask "discord"
# Web browser focusing on privacy
cask "duckduckgo"
# Web browser
cask "firefox"
cask "font-3270-nerd-font"
cask "font-symbols-only-nerd-font"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "gcloud-cli"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Open Source Multimedia Framework
cask "gstreamer-runtime"
# Project management software
cask "lark"
# Interactive tool for analyzing MongoDB data
cask "mongodb-compass"
# Developer IDE or Management Environment for Neo4j instances
cask "neo4j-desktop"
# Web browser
cask "opera"
# System-wide Vim mode for macOS
cask "tonisives/tap/ovim"
# Menu bar app to find and kill processes running on open ports
cask "productdevbook/tap/portkiller"
# Collaboration platform for API development
cask "postman"
# Check important metrics from the menubar
cask "radar"
# Music streaming service
cask "spotify"
# Manage Homebrew packages with a UI
cask "wickenico/wailbrew/wailbrew"
vscode "anthropic.claude-code"
vscode "donjayamanne.githistory"
vscode "hediet.vscode-drawio"
vscode "mhutchie.git-graph"
vscode "ms-ossdata.vscode-pgsql"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
cargo "grip-grab"
